ХМНПФ_Общее/Reports/ХМ_СверкаФинансовыхПоказателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ХМ_СверкаФинансовыхПоказателей</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>выбОперацияНПО</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уп_ОперацияНПО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

ХМНПФ_Общее/AccumulationRegisters/уп_НачисленияПенсий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_НачисленияПенсий</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НалоговаяБазаПоНДФЛ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДнейВПериоде</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Схема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСхемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчетаНачисления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипРезерваНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыРезерва</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипПенсии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыПенсионныхСхем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НачПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КонПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипРезерва</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыРезерва</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипСуммы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ТипыСумм</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ХМНПФ_Общее/Documents/уп_ВозвратПенсий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ВозвратПенсий</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>хм_ВозвратСПлатежногоПоручения</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>хм_ПричинаВозврата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.хм_ПричиныВозвратовПенсий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Участник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормироватьЗадолженость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвращатьНДФЛ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВозвращатьРКО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НекорректныеРеквизиты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументВыплаты</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уп_ВыплатныеРеестры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтражатьВБухгалтерскомУчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>уп_ВидДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ВидыДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ВидыОперацийВозвратПенсий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НДФЛНеУдержанВБюджет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Распределение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СчетДоговора</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НомерСчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ТипРезерва</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уп_ТипыРезерва</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ТипСуммы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ТипыСумм</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СписокСчетов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ТипПенсии</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уп_ТипыПенсионныхСхем</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>РКО</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НомерСчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ПенсионныеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Участник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДатаКонцаПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ПенсионныйДоговор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ПенсионныеДоговоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Схема</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ПенсионныеСхемы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДатаНачалаПериода</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НДФЛ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НБ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДокументВыплаты</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.уп_ВыплатныеРеестры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ХМНПФ_Общее/Reports/ХМ_СверкаФинансовыхПоказателей/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Функция ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента(ПолеТабличногоДокумента, average = 0, count = 0) Экспорт

Сумма = 0;
count = 0;
Для Каждого Область Из ПолеТабличногоДокумента.ВыделенныеОбласти Цикл
   Если ТипЗнч(Область) = Тип("ОбластьЯчеекТабличногоДокумента") Тогда
     Для ИндексСтрока = Область.Верх По Область.Низ Цикл
        Для ИндексКолонка = Область.Лево По Область.Право Цикл
          Попытка
			  	ТекСтрока = СтрЗаменить(ПолеТабличногоДокумента.Область("R" + Формат(ИндексСтрока, "ЧГ=0") + "C" + Формат(ИндексКолонка, "ЧГ=0")) .Текст, " ", "");
				Если ЗначениеЗаполнено(ТекСтрока) Тогда
					ОграничениеТипа = Новый ОписаниеТипов("Число");
					vNumber =  ОграничениеТипа.ПривестиЗначение(ТекСтрока); // = 1111
				Иначе
					Продолжить;
				КонецЕсли;
				Сумма = Сумма + vNumber;
				count = count + 1;
          Исключение
          КонецПопытки;
        КонецЦикла;
     КонецЦикла;
  КонецЕсли;
КонецЦикла;

Если count <> 0 Тогда
   average = Сумма / count;
Иначе
average = 0;
КонецЕсли;
Возврат Сумма;
КонецФункции

&НаКлиенте
Процедура РезультатПриАктивизации(Элемент)
	Сумма = ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента(Результат, Среднее, Количество);
КонецПроцедуры


&НаКлиенте
Процедура ОбменСКаспер(Команда)
	ОткрытьФорму("ВнешнийОтчет.ОтчетыНПОАнализПроцессаНачисленийИВыплатПенсии_внешняя.Форма.АРХИВ_ФормаЗагрузкаКаспер");
КонецПроцедуры


&НаКлиенте
Процедура ФормаПриведенияДанных(Команда)
	ОткрытьФорму("ВнешнийОтчет.ОтчетыНПОАнализПроцессаНачисленийИВыплатПенсии_внешняя.Форма.ФормаПриведенияДанных");
КонецПроцедуры


&НаКлиенте
Процедура СформироватьПоВремени(Команда)
	ТД = ТекущаяДата();
	ЭтотОбъект.СкомпоноватьРезультат();
	Сообщить(ТекущаяДата() - ТД);
КонецПроцедуры


&НаКлиенте
Процедура ОбменСКасперНаПрямую(Команда)
	ОткрытьФорму("ВнешнийОтчет.ОтчетыНПОАнализПроцессаНачисленийИВыплатПенсии_внешняя.Форма.ФормаЗагрузкаКасперНаПрямую");
КонецПроцедуры


&НаСервере
Функция СформироватьДеревоНаСервере(ПараметрыДанных = Неопределено, ПараметрыОтбора = Неопределено)

	ОбработкаОтчет = РеквизитФормыВЗначение("Отчет");  // мы получаем именно объект
	СхемаКомпоновкиДанных = ОбработкаОтчет.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных"); // где "макет" - название вашего макета
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		
	НастройкиОтчета = Отчет.КомпоновщикНастроек.ПолучитьНастройки();
	Если Не ПараметрыДанных = Неопределено Тогда
		Для каждого Параметр Из НастройкиОтчета.ПараметрыДанных.Элементы Цикл
			Если Параметр.Использование = Истина Тогда
				ПараметрыДанных.Вставить(""+Параметр.Параметр,Параметр.Значение);	
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если Не ПараметрыОтбора = Неопределено Тогда
		Для каждого Параметр Из НастройкиОтчета.Отбор.Элементы Цикл
			Если ТипЗнч(Параметр) = Тип("ЭлементОтбораКомпоновкиДанных") И Параметр.Использование = Истина Тогда
				ПараметрыОтбора.Вставить(""+Параметр.ЛевоеЗначение,Параметр.ПравоеЗначение);	
			КонецЕсли;     
		КонецЦикла;
	КонецЕсли;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,НастройкиОтчета
		,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));

	ПроцессорКомпоновкиДанных= Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	Дерево  = Новый ДеревоЗначений;
	ПроцессорВывода = Новый    ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(Дерево);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	Возврат Дерево;   

КонецФункции

&НаСервере
Процедура ПроверитьДеревоНаСервере()
	ДеревоНаСервере = СформироватьДеревоНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура СформироватьДерево(Команда)
	ПроверитьДеревоНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПровестиРегистраторНаСервере()
	ДеревоНаСервере = СформироватьДеревоНаСервере();
	МассивРегистраторов = Новый Массив();
	ПровестиРегистраторРекурсия(ДеревоНаСервере,МассивРегистраторов);
КонецПроцедуры

&НаСервере
Процедура ПровестиРегистраторРекурсия(ДеревоНаСервере,МассивРегистраторов)
	Для каждого Строка Из ДеревоНаСервере.Строки Цикл
		Если ЗначениеЗаполнено(Строка.Регистратор) Тогда
			Если МассивРегистраторов.Найти(Строка.Регистратор) = Неопределено Тогда
				МассивРегистраторов.Добавить(Строка.Регистратор);
				Строка.Регистратор.ПолучитьОбъект().Записать(РежимЗаписиДокумента.Проведение);	
			КонецЕсли;
		Иначе
			ПровестиРегистраторРекурсия(Строка,МассивРегистраторов)	
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПровестиРегистратор(Команда)
	ПровестиРегистраторНаСервере(); 
	Попытка
		spVoice = Новый COMОбъект("SAPI.SpVoice");
		spVoice.Speak("Проведение завершено");
		spVoice = Неопределено;
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ФормаСторноНДФЛ(Команда)
	ОткрытьФорму("ВнешнийОтчет.ОтчетыНПОАнализПроцессаНачисленийИВыплатПенсии_внешняя.Форма.ФормаСторноНДФЛ");
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРезервПоНачислениюДвижения(Регистратор)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	уп_НачисленияПенсий.Период КАК Период,
		|	уп_НачисленияПенсий.Регистратор КАК Регистратор,
		|	уп_НачисленияПенсий.НомерСтроки КАК НомерСтроки,
		|	уп_НачисленияПенсий.Активность КАК Активность,
		|	уп_НачисленияПенсий.ВидДвижения КАК ВидДвижения,
		|	уп_НачисленияПенсий.НомерСчета КАК НомерСчета,
		|	уп_НачисленияПенсий.НачПериода КАК НачПериода,
		|	уп_НачисленияПенсий.КонПериода КАК КонПериода,
		|	уп_НачисленияПенсий.ТипРезерва КАК ТипРезерва,
		|	уп_НачисленияПенсий.ТипСуммы КАК ТипСуммы,
		|	уп_НачисленияПенсий.Сумма КАК Сумма,
		|	уп_НачисленияПенсий.НалоговаяБазаПоНДФЛ КАК НалоговаяБазаПоНДФЛ,
		|	уп_НачисленияПенсий.ДнейВПериоде КАК ДнейВПериоде,
		|	уп_НачисленияПенсий.Схема КАК Схема,
		|	уп_НачисленияПенсий.НомерСчетаНачисления КАК НомерСчетаНачисления,
		|	уп_НачисленияПенсий.ТипРезерваНачисления КАК ТипРезерваНачисления,
		|	уп_НачисленияПенсий.ТипПенсии КАК ТипПенсии,
		|	уп_НачисленияПенсий.МоментВремени КАК МоментВремени
		|ИЗ
		|	РегистрНакопления.уп_НачисленияПенсий КАК уп_НачисленияПенсий
		|ГДЕ
		|	уп_НачисленияПенсий.Регистратор = &Регистратор";
	
	Запрос.УстановитьПараметр("Регистратор", Регистратор);
	
	ТабНачислений = Запрос.Выполнить().Выгрузить();
	
	Движение = РегистрыНакопления.уп_Резервы.СоздатьНаборЗаписей();
	Движение.Отбор.Регистратор.Установить(Регистратор);	

	ТабРезервовНПО = Документы.уп_ВозвратПенсий.ДвиженияПоРезервамНПО(Регистратор, Регистратор.Дата, Регистратор.Организация, ТабНачислений, , , Истина);
	Для каждого СтрокаРезервов Из ТабРезервовНПО Цикл
		СтрокаРезерыНачислений = Движение.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаРезерыНачислений,СтрокаРезервов);
		СтрокаРезерыНачислений.ВидДвижения = ВидДвиженияНакопления.Приход;
		
		СтрокаРезерыНачислений = Движение.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаРезерыНачислений,СтрокаРезервов);
		СтрокаРезерыНачислений.ВидДвижения = ВидДвиженияНакопления.Расход;
		СтрокаРезерыНачислений.ТипРезерва = СтрокаРезервов.ТипРезерваИсх;
	КонецЦикла;
	
	Движение.Записать();

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРезервПоНачислениюРекурсия(ДеревоНаСервере,МассивРегистраторов)
	Для каждого Строка Из ДеревоНаСервере.Строки Цикл
		Если ЗначениеЗаполнено(Строка.Регистратор) Тогда
			Если МассивРегистраторов.Найти(Строка.Регистратор) = Неопределено Тогда
				МассивРегистраторов.Добавить(Строка.Регистратор);
				ЗаполнитьРезервПоНачислениюДвижения(Строка.Регистратор);
			КонецЕсли;
		Иначе
			ЗаполнитьРезервПоНачислениюРекурсия(Строка,МассивРегистраторов)	
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРезервПоНачислениюНаСервере()
	ДеревоНаСервере = СформироватьДеревоНаСервере();
	МассивРегистраторов = Новый Массив();
	ЗаполнитьРезервПоНачислениюРекурсия(ДеревоНаСервере,МассивРегистраторов);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРезервПоНачислению(Команда)
	ЗаполнитьРезервПоНачислениюНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПровестиПоЗадолженностиВНачисленииДвижения(Регистратор)
	//Бардошина +
	//по ТЧ "Список пенсионеров" проверяем наличие остатка в РН npo_НачислениеЗадолженностиПоПриостановкам (соответствие по всем измерениям), списываем его
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	уп_НачислениеПенсийСписокПенсионеров.НомерСчета КАК НомерСчета,
		|	уп_НачислениеПенсийСписокПенсионеров.НачалоПериодаНачисления КАК НачПериода,
		|	уп_НачислениеПенсийСписокПенсионеров.КонецПериодаНачисления КАК КонПериода,
		|	СУММА(уп_НачислениеПенсийСписокПенсионеров.Сумма) КАК Сумма,
		|	СУММА(уп_НачислениеПенсийСписокПенсионеров.Доплата) КАК Доплата,
		|	МИНИМУМ(уп_НачислениеПенсийСписокПенсионеров.НомерСтроки) КАК НомерСтроки,
		|	уп_НачислениеПенсийСписокПенсионеров.Ссылка.Дата КАК Дата
		|ПОМЕСТИТЬ СписокПенсионеров
		|ИЗ
		|	Документ.уп_НачислениеПенсий.СписокПенсионеров КАК уп_НачислениеПенсийСписокПенсионеров
		|ГДЕ
		|	уп_НачислениеПенсийСписокПенсионеров.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	уп_НачислениеПенсийСписокПенсионеров.НомерСчета,
		|	уп_НачислениеПенсийСписокПенсионеров.НачалоПериодаНачисления,
		|	уп_НачислениеПенсийСписокПенсионеров.КонецПериодаНачисления,
		|	уп_НачислениеПенсийСписокПенсионеров.Ссылка.Дата
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	НомерСчета
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СписокПенсионеров.НомерСтроки КАК НомерСтроки,
		|	npo_ЗадолженностьПоПенсиямОстатки.НомерСчета КАК НомерСчета,
		|	npo_ЗадолженностьПоПенсиямОстатки.НачалоПериода КАК НачалоПериода,
		|	npo_ЗадолженностьПоПенсиямОстатки.КонецПериода КАК КонецПериода,
		|	СписокПенсионеров.Сумма КАК Сумма,
		|	СписокПенсионеров.Доплата КАК Доплата,
		|	npo_ЗадолженностьПоПенсиямОстатки.СчетчикОстаток КАК СчетчикОстаток,
		|	npo_ЗадолженностьПоПенсиямОстатки.СуммаПенсииОстаток КАК СуммаОстаток,
		|	npo_ЗадолженностьПоПенсиямОстатки.СуммаДоплатыОстаток КАК ДоплатаОстаток,
		|	ПРЕДСТАВЛЕНИЕ(npo_ЗадолженностьПоПенсиямОстатки.НомерСчета) КАК НомерСчетаТекст,
		|	СписокПенсионеров.Дата КАК Дата
		|ИЗ
		|	СписокПенсионеров КАК СписокПенсионеров
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.уп_ЗадолженностьПоПенсиям.Остатки(
		|				&МоментВремени,
		|				НомерСчета В
		|					(ВЫБРАТЬ
		|						СписокПенсионеров.НомерСчета КАК НомерСчета
		|					ИЗ
		|						СписокПенсионеров КАК СписокПенсионеров)) КАК npo_ЗадолженностьПоПенсиямОстатки
		|		ПО СписокПенсионеров.НомерСчета = npo_ЗадолженностьПоПенсиямОстатки.НомерСчета
		|			И СписокПенсионеров.НачПериода = npo_ЗадолженностьПоПенсиямОстатки.НачалоПериода
		|			И СписокПенсионеров.КонПериода = npo_ЗадолженностьПоПенсиямОстатки.КонецПериода";
	
	Запрос.УстановитьПараметр("Ссылка", Регистратор);
	Запрос.УстановитьПараметр("МоментВремени", Регистратор.МоментВремени());
	
	НЗ_Движение = РегистрыНакопления.уп_ЗадолженностьПоПенсиям.СоздатьНаборЗаписей();
	НЗ_Движение.Отбор.Регистратор.Установить(Регистратор);	
	НЗ_Движение.Записать();

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	НЗ_Движение = РегистрыНакопления.уп_ЗадолженностьПоПенсиям.СоздатьНаборЗаписей();
	НЗ_Движение.Отбор.Регистратор.Установить(Регистратор);	
    Отказ = Ложь;
	Пока Выборка.Следующий() Цикл
		СуммаНехватка = Выборка.Сумма - Выборка.СуммаОстаток;
		ДоплатаНехватка = Выборка.Доплата - Выборка.ДоплатаОстаток;
		Если СуммаНехватка > 0 ИЛИ ДоплатаНехватка > 0 Тогда
			Если СуммаНехватка > 0 Тогда
				ТекстСообщения = "По счету № " + Выборка.НомерСчетаТекст + " сумма превышает сумму задолженности на " + СуммаНехватка + " руб."; 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Регистратор, "СписокПенсионеров["+(Выборка.НомерСтроки-1)+"].Сумма", "Объект", Отказ);
			КонецЕсли;
			Если ДоплатаНехватка > 0 Тогда
				ТекстСообщения = "По счету № " + Выборка.НомерСчетаТекст + " сумма доплаты превышает сумму задолженности на " + ДоплатаНехватка + " руб."; 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Регистратор, "СписокПенсионеров["+(Выборка.НомерСтроки-1)+"].Доплата", "Объект", Отказ);
			КонецЕсли;
			Продолжить;
		КонецЕсли;
		Движение = НЗ_Движение.ДобавитьРасход();
		Движение.НомерСчета = Выборка.НомерСчета;
		Движение.Период = Выборка.Дата;
		Движение.НачалоПериода = Выборка.НачалоПериода;
		Движение.КонецПериода = Выборка.КонецПериода;
		Движение.Счетчик = Выборка.СчетчикОстаток;
		Движение.СуммаПенсии = Выборка.Сумма;
		Движение.СуммаДоплаты = Выборка.Доплата;
	КонецЦикла;
	
	НЗ_Движение.Записать();
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура ПровестиПоЗадолженностиВНачисленииРекурсия(ДеревоНаСервере,МассивРегистраторов)
	Для каждого Строка Из ДеревоНаСервере.Строки Цикл
		Если ЗначениеЗаполнено(Строка.Регистратор) Тогда
			Если МассивРегистраторов.Найти(Строка.Регистратор) = Неопределено Тогда
				МассивРегистраторов.Добавить(Строка.Регистратор);
				ПровестиПоЗадолженностиВНачисленииДвижения(Строка.Регистратор);
			КонецЕсли;
		Иначе
			ПровестиПоЗадолженностиВНачисленииРекурсия(Строка,МассивРегистраторов)	
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПровестиПоЗадолженностиВНачисленииНаСервере()
	ДеревоНаСервере = СформироватьДеревоНаСервере();
	МассивРегистраторов = Новый Массив();
	ПровестиПоЗадолженностиВНачисленииРекурсия(ДеревоНаСервере,МассивРегистраторов);
КонецПроцедуры

&НаКлиенте
Процедура ПровестиПоЗадолженностиВНачислении(Команда)
	ПровестиПоЗадолженностиВНачисленииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыполнитьЗагрузкуСКД(ИмяКоманды)
    
	
	СтрокаПравилСервер = Новый Структура();
	СтрокаПравилСервер.Вставить("ДополнитьДвижения",ДополнитьДвижения);
	СтрокаПравилСервер.Вставить("ОчиститьДвижения",ОчиститьДвижения);
	
	
	Если Не ДобавитьВЕЖ И Не ОбновитьВЕЖ И Не СоздатьМЗ Тогда
		Если Не ОчиститьДвижения Тогда	
			ДеревоНаСервере = СформироватьДеревоНаСервере();
		Иначе
			ДеревоНаСервере = Неопределено;
		КонецЕсли;
		ОтчетОбъект = РеквизитФормыВЗначение("Отчет"); 
		Выполнить("ОтчетОбъект."+ ИмяКоманды +"(ДеревоНаСервере,Отчет.выбОперацияНПО,СтрокаПравилСервер)");
	Иначе
		хм_МеханизмыСверкиСервер.СКД_ВыполнитьПоМеханизмуЗагрузкиV4(ЭтаФорма,Отчет,ИмяКоманды,"Отчеты.ХМ_СверкаФинансовыхПоказателей.Создать()." + ИмяКоманды);
	КонецЕсли;
    


КонецПроцедуры

&НаКлиенте
Процедура п223ОчиститьЗадолженность(Команда)
	ВыполнитьЗагрузкуСКД(Команда.Имя);
	Попытка
		spVoice = Новый COMОбъект("SAPI.SpVoice");
		spVoice.Speak("Обработка завершена");
		spVoice = Неопределено;
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура п224ОчиститьНачисление(Команда)
	ВыполнитьЗагрузкуСКД(Команда.Имя);
	Попытка
		spVoice = Новый COMОбъект("SAPI.SpVoice");
		spVoice.Speak("Обработка завершена");
		spVoice = Неопределено;
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура п225ОчиститьРезервыНачислений(Команда)
	ВыполнитьЗагрузкуСКД(Команда.Имя);
	Попытка
		spVoice = Новый COMОбъект("SAPI.SpVoice");
		spVoice.Speak("Обработка завершена");
		spVoice = Неопределено;
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура п226ОстаткиУдержанийВФонд(Команда)
	ВыполнитьЗагрузкуСКД(Команда.Имя);
	Попытка
		spVoice = Новый COMОбъект("SAPI.SpVoice");
		spVoice.Speak("Обработка завершена");
		spVoice = Неопределено;
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура п11СкорректироватьРезерв(Команда)
	ВыполнитьЗагрузкуСКД(Команда.Имя);
	Попытка
		spVoice = Новый COMОбъект("SAPI.SpVoice");
		spVoice.Speak("Обработка завершена");
		spVoice = Неопределено;
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура п227СкорректироватьУдержания3лиц(Команда)
	ВыполнитьЗагрузкуСКД(Команда.Имя);
	Попытка
		spVoice = Новый COMОбъект("SAPI.SpVoice");
		spVoice.Speak("Обработка завершена");
		spVoice = Неопределено;
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура п301ОчиститьНДФЛпоРегистратору(Команда)
	ВыполнитьЗагрузкуСКД(Команда.Имя);
	Попытка
		spVoice = Новый COMОбъект("SAPI.SpVoice");
		spVoice.Speak("Обработка завершена");
		spVoice = Неопределено;
	Исключение
	КонецПопытки;
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ПередатьНаСверку" Тогда //И Не Источник.ИмяФормы = ЭтаФорма.ИмяФормы Тогда
		Если Источник.УникальныйИдентификатор = ЭтаФорма.УникальныйИдентификатор Тогда
			Возврат;	
		КонецЕсли;
		Если ЭтаФорма.ГлавнаяФорма Тогда
			Возврат;
		КонецЕсли;
		
		Если Параметр.ИмяПоля = "НомерСчета" Тогда
			сз = Новый СписокЗначений;  
			сз.ЗагрузитьЗначения(Параметр.МассивСверки);  
			ДобавитьПользовательскийОтбор(
				Новый ПолеКомпоновкиДанных("НомерСчета"),
				сз,
				ВидСравненияКомпоновкиДанных.ВСписке,
				Истина,
				Новый Структура("ВПользовательскиеНастройки, ЗаменятьСуществующий", Истина, Истина));
		КонецЕсли;     
		ЭтаФорма.Активизировать();
//		ЭтаФорма.СкомпоноватьРезультат(РежимКомпоновкиРезультата.Фоновый);	
	КонецЕсли;
	// Вставить содержимое обработчика.
КонецПроцедуры         


&НаКлиенте
Процедура ДобавитьПользовательскийОтбор(ПолеКомпоновки, ЗначениеОтбора, ВидСравнения, Использование, ДополнительныеПараметры)     
	ОтборНастройки = Отчет.КомпоновщикНастроек.Настройки.Отбор;
	ЭлементыПользовательскиеНастройки = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;

	ЭлементОтбора = ПолучитьЭлементОтбора(ПолеКомпоновки, ОтборНастройки);
	
	Если ЭлементОтбора = Неопределено Тогда
	   ЭлементОтбора = ОтборНастройки.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	   ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновки;
	   ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
	   
	   //Создаем идентификатор пользовательской настройки, чтобы отбор добавился в пользовательские настройки
	   ЭлементОтбора.ИдентификаторПользовательскойНастройки = Новый УникальныйИдентификатор;
	   СоздатьЭлементыФормыПользовательскихНастроекНаСервере();
	КонецЕсли;
		
	//Находим отбор в пользовательских настройках по идентификатору
	ОтборПоСкладуПользовательскиеНастройки = ЭлементыПользовательскиеНастройки.Найти(ЭлементОтбора.ИдентификаторПользовательскойНастройки);
	ОтборПоСкладуПользовательскиеНастройки.Использование = Использование;
	ОтборПоСкладуПользовательскиеНастройки.ВидСравнения = ВидСравнения;
	ОтборПоСкладуПользовательскиеНастройки.ПравоеЗначение = ЗначениеОтбора;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьЭлементОтбора(ПолеКомпоновки, ГруппаОтбора)
	Для каждого ТекЭлементОтбора Из ГруппаОтбора.Элементы Цикл
	   Если ТипЗнч(ТекЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных")
	             и ТекЭлементОтбора.ЛевоеЗначение = ПолеКомпоновки Тогда
	      Возврат ТекЭлементОтбора;
	   ИначеЕсли НЕ ТипЗнч(ТекЭлементОтбора) = Тип("ЭлементОтбораКомпоновкиДанных")	Тогда   
		  	ЭлементОтбора  = ПолучитьЭлементОтбора(ПолеКомпоновки, ТекЭлементОтбора);
		  	Если Не ЭлементОтбора = Неопределено Тогда
				Возврат ЭлементОтбора;	
			КонецЕсли;
	   КонецЕсли;	
   КонецЦикла;
   Возврат Неопределено;
КонецФункции

&НаСервере
Процедура СоздатьЭлементыФормыПользовательскихНастроекНаСервере()
	   СоздатьЭлементыФормыПользовательскихНастроек();
КонецПроцедуры

&НаСервере
Функция ОбработатьВыделенноеНаСервере(СтрокаКоманда,Верх,Низ,Лево,Право, ДополнительныеПараметры = Неопределено)
	ДанныеВозврата = Новый Массив;
	
	МассивРассшифровки = Новый Массив();
	ДанныеОтчета = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	Для ИндексСтрока = Верх По Низ Цикл
		Для ИндексКолонка = Лево По Право Цикл
			Попытка
				Ячейка = Результат.Область("R" + Формат(ИндексСтрока, "ЧГ=0") + "C" + Формат(ИндексКолонка, "ЧГ=0"));
				Если Ячейка.Расшифровка = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				ПолеРасшифровки = ДанныеОтчета.Элементы.Получить(Ячейка.Расшифровка).ПолучитьПоля()[0];
				Если Не ПолеРасшифровки = Неопределено 
					И (ДополнительныеПараметры.Свойство("ИмяПоля") = ЛОЖЬ ИЛИ ПолеРасшифровки.Поле = ДополнительныеПараметры.ИмяПоля)
					И (ДополнительныеПараметры.Свойство("ПоляДляУточнения") = ЛОЖЬ ИЛИ ДополнительныеПараметры.ПоляДляУточнения.Свойство(ПолеРасшифровки.Поле) = Истина)Тогда //и ПолеРасшифровки.Поле = "ТекСостояние.Регистратор" Тогда
					ЗначенниеРасшифровки = ПолеРасшифровки.Значение;
					Если ЗначениеЗаполнено(ЗначенниеРасшифровки) Тогда
						Если СтрокаКоманда = "ПровестиВыделенные" Тогда
							ЗначенниеРасшифровки.ПолучитьОбъект().Записать(РежимЗаписиДокумента.Проведение);
						КонецЕсли;
						Если СтрокаКоманда = "ПерегрузитьИзКаспер" Тогда
							ДанныеВозврата.Добавить(ЗначенниеРасшифровки);	
						КонецЕсли;
						Если СтрокаКоманда = "ОповеститьОВыборе" Тогда
							ДанныеВозврата.Добавить(ЗначенниеРасшифровки);	
						КонецЕсли;
					КонецЕсли;
				КонецЕсли; 
			Исключение
				Сообщить(ОписаниеОшибки());
			КонецПопытки;
		КонецЦикла;
	КонецЦикла;
	Если СтрокаКоманда = "ПерегрузитьИзКаспер" Тогда
		ХМ_ЗагрузкаТЗ_V02_ВызовСервера.ИнтерактивнаяЗагрузкаДокументов(ДанныеВозврата,Новый Структура("ОбновитьЗагрузку,ПотоковаяЗагрузка,ЗагрузкаСписком"),Новый Структура("Статус","НП"));
		ХМ_ЗагрузкаТЗ_V02_ВызовСервера.ИнтерактивнаяЗагрузкаДокументов(ДанныеВозврата,Новый Структура("ОбновитьЗагрузку,ПотоковаяЗагрузка,ЗагрузкаСписком"),Новый Структура("Статус","НЕ"));
	КонецЕсли;
	Возврат ДанныеВозврата;
КонецФункции

&НаКлиенте
Процедура ОбработатьВыделенное(СтрокаКоманда,ДополнительныеПараметры = Неопределено)

	МассивРассшифровки = Новый Массив();
    ПоляДляУточнения = Новый Структура();
	Для Каждого Область Из Результат.ВыделенныеОбласти Цикл
		Если ТипЗнч(Область) = Тип("ОбластьЯчеекТабличногоДокумента") Тогда
			Верх = Область.Верх;
			Низ = Область.Низ;
			Лево = Область.Лево;
			Право = Область.Право;
			
			Если СтрокаКоманда = "ОповеститьОВыборе" Тогда
				Лево = 1;
				Право = Результат.ШиринаТаблицы;
			КонецЕсли;
			
			НовыйМассивРассшифровки = ОбработатьВыделенноеНаСервере(СтрокаКоманда,Верх,Низ,Лево,Право,ДополнительныеПараметры);
			ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивРассшифровки,НовыйМассивРассшифровки);
		КонецЕсли;
	КонецЦикла;
	
	Если СтрокаКоманда = "ОповеститьОВыборе" Тогда 
		ДополнительныеПараметры.Вставить("МассивСверки",МассивРассшифровки);
		Оповестить(ДополнительныеПараметры.ИмяСобытия, ДополнительныеПараметры, ЭтаФорма);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередатьСчетаНаСверку(Команда)
	ОбработатьВыделенное("ОповеститьОВыборе", Новый Структура("ИмяСобытия, ИмяПоля","ПередатьНаСверку","НомерСчета"));
КонецПроцедуры
